1、基本配置
安装xampp   phph项目放到htdocs目录下 
启动apache 访问localhost/项目文件夹  
启动mysql  访问localhost  找到右上角'phpmyadmin'进行数据库设置  或下载mysql workbench客户端 https://dev.mysql.com/downloads/workbench/

2、乱码。PHP+MYSQL 出现乱码的解决方法
mysql_query("SET NAMES 'UTF8'"); 
mysql_query("SET CHARACTER SET UTF8"); 
mysql_query("SET CHARACTER_SET_RESULTS=UTF8'"); 

3、魔术方法。PHP 将所有以 __（两个下划线）开头的类方法保留为"魔术方法"（Magic methods）。
会自动调用，所以在定义类方法时，除了下述魔术方法，建议不要以 __ 为前缀。
如构造函数__construct()， 析构函数__destruct()， __call()， __callStatic()， __get()， __set()， __isset()，
__unset()， __sleep()， __wakeup()， __toString()， __invoke()， __set_state()，
__clone() 和 __debugInfo() 

4、访问修饰符 
public（公共的、默认） 
protected（受保护的） 子类可以访问 该类外部代码不能访问
private（私有的）     子类不能访问

5、parent::
使用parent::来引用父类的方法。
子类继承父类时方法重载
http://www.cnblogs.com/xiaochaohuashengmi/archive/2010/09/10/1823042.html

6、final关键字标记的类不能被继承
final关键字标记的方法不能被子类覆盖 

7、static关键字是在类中描述成员属性和成员方法是静态的
static成员能够限制外部的访问，因为static的成员是属于类的，
是不属于任何对象实例，是在类第一次被加载的时候分配的空间，
其他类是无法访问的，只对类的实例共享，能一定程度对类该成员形成保护
使用对象访问不到静态成员， 类里面的静态方法只能访问类的静态的属性
静态的方法是不用对象调用的，而是使用类名来访问

const是一个定义常量的关键字，在PHP中定义常量使用的是“define()”这个函数，
但是在类里面定义常量使用的是“const”这个关键字，
类似于C中的#define如果在程序中改变了它的值，那么会出现错误，
用“const”修饰的成员属性的访问方式和“static”修饰的成员访问的方式差不多，
也是使用“类名”，在方法里面使用“self”关键字。但是不用使用“$”符号，也不能使用对象来访问。

8、抽象方法 抽象类
我们在类里面定义的没有方法体的方法就是抽象方法，
所谓的没有方法体指的是，在方法声明的时候没有大括号以及其中的内容，
而是直接在声明时在方法名后加上分号结束，另外在声明抽象方法时还要加一个关键字“abstract”来修饰；
例如：abstract function fun1();

只要一个类里面有一个方法是抽象方法，那么这个类就要定义为抽象类，抽象类也要使用“abstract”关键字来修饰
抽象类不能产生实例对象
子类必须把父类中的抽象方法全部都实现，否则子类中还存在抽象方法，那么子类还是抽象类，还是不能实例化类
类的定义：  class 类名{ … } ，
接口的声明：interface 接口名{ …}
9、接口(interface)
接口是一种特殊的抽象类，抽象类又是一种特殊的类，所以接口也是一种特殊的类
如果一个抽象类里面的所有的方法都是抽象方法，那么我们就换一种声明方法使用“接口”；
也就是说接口里面所有的方法必须 都是声明为抽象方法，另外接口里面不能声明变量(但可声明常量constant)，
而且接口里面所有的成员都是public权限的。所以子类在实现的时候 也一定要使用public权限实限。

10、序列化
有时候需要把一个对象在网络上传输，为了方便传输，可以把整个对象转化为二进制串，
等到达另一端时，再还原为原来的对象，这个过程称之为串行化(也叫序列化)。
有两种情况我们必须把对象串行化，第一种情况就是把一个对象在网络中传输的时候要将对象串行化，
第二种情况就是把对象写入文件或是数据库的时候用到串行化。
串行化有两个过程，一个是串行化，就是把对象转化为二进制的字符串，我们使用serialize()函数来串行化一个对象，
另一个是反串行化，就是把对象转化的二进制字符串再转化为对象， 我们使用unserialize()函数来反串行化一个对象。
